newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R_features.h
/* SRX module features */

/* Combined Interrupts */
#define FEATURE_SRX_HAS_COMBINED_IRQ

/* Has FIFO */
#define FEATURE_SRX_DMA_HAS_FIFO

/* Maximum Fast messages FIFO depth */
#define FEATURE_SRX_MAX_FIFO_SIZE (16U)

/* Has nibble length limit */
#define FEATURE_SRX_HAS_NIB_LEN_VAR_LIMIT

/* Mappings */
#define FEATURE_SRX_FAST_DMA_REQS {EDMA_REQ_SRX_0_FAST, EDMA_REQ_SRX_1_FAST}
#define FEATURE_SRX_SLOW_DMA_REQS {EDMA_REQ_SRX_0_SLOW, EDMA_REQ_SRX_1_SLOW}
#define FEATURE_SRX_CLOCK_NAMES {SENT0_CLK, SENT1_CLK}
#define FEATURE_SRX_IRQS {{SRX0_CH0_IRQn, SRX0_CH1_IRQn, SRX0_CH2_IRQn, SRX0_CH3_IRQn, SRX0_CH4_IRQn, SRX0_CH5_IRQn}, \
                          {SRX1_CH0_IRQn, SRX1_CH1_IRQn, SRX1_CH2_IRQn, SRX1_CH3_IRQn, SRX1_CH4_IRQn, SRX1_CH5_IRQn}}

/* PSI5 module features */

/* Channel count */
#define FEATURE_PSI5_CHANNEL_COUNT (1U)
/* Channel count */
#define FEATURE_PSI5_SLOT_COUNT (PSI5_CH0_SFR_COUNT)
/* Maximum number of FIFO locations */
#define FEATURE_PSI5_FIFO_COUNT (PSI5_CH0_PMR_COUNT)
/* Master instance */
#define FEATURE_PSI5_MASTER_INSTANCE (0U)
/* Mappings */
#define FEATURE_PSI5_IRQS {{PSI50_SDOE_IRQn}, {PSI51_SDOE_IRQn}}

/* CAN module features */

/* @brief Frames available in Rx FIFO flag shift */
#define FEATURE_CAN_RXFIFO_FRAME_AVAILABLE  (5U)
/* @brief Rx FIFO warning flag shift */
#define FEATURE_CAN_RXFIFO_WARNING          (6U)
/* @brief Rx FIFO overflow flag shift */
#define FEATURE_CAN_RXFIFO_OVERFLOW         (7U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN0 */
#define FEATURE_CAN0_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN1 */
#define FEATURE_CAN1_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN2 */
#define FEATURE_CAN2_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN3 */
#define FEATURE_CAN3_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for any of the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM              (64U)
/* @brief Array of maximum number of Message Buffers supported for payload size 8 for all the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM_ARRAY        { FEATURE_CAN0_MAX_MB_NUM, \
                                              FEATURE_CAN1_MAX_MB_NUM, \
                                              FEATURE_CAN2_MAX_MB_NUM, \
                                              FEATURE_CAN3_MAX_MB_NUM  }
/* @brief Has PE clock source select (bit field CAN_CTRL1[CLKSRC]). */
#define FEATURE_CAN_HAS_PE_CLKSRC_SELECT            (1)
/* @brief Has Pretending Networking mode */
#define FEATURE_CAN_HAS_PRETENDED_NETWORKING        (0)
/* @brief Has Stuff Bit Count Enable Bit */
#define FEATURE_CAN_HAS_STFCNTEN_ENABLE             (0)
/* @brief Has ISO CAN FD Enable Bit */
#define FEATURE_CAN_HAS_ISOCANFDEN_ENABLE           (0)
/* @brief Has Message Buffer Data Size Region 1 */
#define FEATURE_CAN_HAS_MBDSR1                      (0)
/* @brief Has Message Buffer Data Size Region 2 */
#define FEATURE_CAN_HAS_MBDSR2                      (0)
/* @brief Has Supervisor Mode MCR[SUPV]*/
#define FEATURE_CAN_HAS_SUPV             	        (1)
/* @brief Has DMA enable (bit field MCR[DMA]). */
#define FEATURE_CAN_HAS_DMA_ENABLE                  (0)
/* @brief Maximum number of Message Buffers IRQs */
#define FEATURE_CAN_MB_IRQS_MAX_COUNT       (18U)
/* @brief Has Wake Up Irq channels (CAN_Wake_Up_IRQS_CH_COUNT > 0u) */
#define FEATURE_CAN_HAS_WAKE_UP_IRQ         (0U)
/* @brief Message Buffers IRQs */
#define FEATURE_CAN_MB_IRQS                 { CAN_ORed_00_MB_IRQS, \
                                              CAN_ORed_01_MB_IRQS, \
                                              CAN_ORed_02_MB_IRQS, \
                                              CAN_ORed_03_MB_IRQS, \
                                              CAN_ORed_04_MB_IRQS, \
                                              CAN_ORed_05_MB_IRQS, \
                                              CAN_ORed_06_MB_IRQS, \
                                              CAN_ORed_07_MB_IRQS, \
                                              CAN_ORed_08_MB_IRQS, \
                                              CAN_ORed_09_MB_IRQS, \
                                              CAN_ORed_10_MB_IRQS, \
                                              CAN_ORed_11_MB_IRQS, \
                                              CAN_ORed_12_MB_IRQS, \
                                              CAN_ORed_13_MB_IRQS, \
                                              CAN_ORed_14_MB_IRQS, \
                                              CAN_ORed_15_MB_IRQS, \
                                              CAN_ORed_16_31_MB_IRQS, \
                                              CAN_ORed_32_63_MB_IRQS }
/*! @brief FlexCAN Embedded RAM address offset */
#define FEATURE_CAN_RAM_OFFSET              (0x00000060u)
/* @brief Has Self Wake Up mode */
#define FEATURE_CAN_HAS_SELF_WAKE_UP        (0)
/* @brief Has Flexible Data Rate */
#define FEATURE_CAN_HAS_FD                  (0)

#define CAN_IMASK1_BUF31TO0M_MASK           CAN_IMASK1_BUFLM_MASK
#define CAN_IMASK2_BUF63TO32M_MASK          CAN_IMASK2_BUFHM_MASK
/* @brief Clock name for the PE oscillator clock source */
#define FEATURE_CAN_PE_OSC_CLK_NAME         XOSC_CLK
/* @bried FlexCAN has Detection And Correction of Memory Errors */
#define FEATURE_CAN_HAS_MEM_ERR_DET         (0)
/* @bried FlexCAN has ECC requires clear of RXMASKs reg */
#define FEATURE_CAN_ECC_CLEAR_RXMASKS       (0)

/* SIU module feature */
/** GPIO - Register Layout Typedef */
typedef struct {
  __IO uint32_t PGPDO; /**< Parallel GPIO Pin Data Output Registers, array offset: 0xC00, array step: 0x4 */
       uint32_t RESERVED_PGPDO[SIU_PGPDO_COUNT - 1U];
  __I  uint32_t PGPDI; /**< Parallel GPIO Pin Data Input  Registers, array offset: 0xC40, array step: 0x4 */
} GPIO_Type;

/** Number of GPIO instances of the SIU module. */
#define GPIO_INSTANCE_COUNT                  (SIU_PGPDO_COUNT)
/** Peripheral SIU base address */
#define GPIO_BASE                            (0xC3F90C00u)
/** Peripheral GPIO base pointer */
#define GPIO                                 ((GPIO_Type *)GPIO_BASE)
 /* GPIO - Peripheral instance base addresses */
#define PTC                                  ((GPIO_Type *)(GPIO_BASE + 0x08u))
#define PTD                                  ((GPIO_Type *)(GPIO_BASE + 0x0Cu))
#define PTE                                  ((GPIO_Type *)(GPIO_BASE + 0x10u))
#define PTF                                  ((GPIO_Type *)(GPIO_BASE + 0x14u))
#define PTG                                  ((GPIO_Type *)(GPIO_BASE + 0x18u))
#define PTH                                  ((GPIO_Type *)(GPIO_BASE + 0x1Cu))
#define PTI                                  ((GPIO_Type *)(GPIO_BASE + 0x20u))
#define PTJ                                  ((GPIO_Type *)(GPIO_BASE + 0x24u))
#define PTK                                  ((GPIO_Type *)(GPIO_BASE + 0x28u))
#define PTL                                  ((GPIO_Type *)(GPIO_BASE + 0x2Cu))
#define PTM                                  ((GPIO_Type *)(GPIO_BASE + 0x30u))
#define PTN                                  ((GPIO_Type *)(GPIO_BASE + 0x34u))
#define PTO                                  ((GPIO_Type *)(GPIO_BASE + 0x38u))
#define PTP                                  ((GPIO_Type *)(GPIO_BASE + 0x3Cu))
/** Array initializer of GPIO peripheral base pointers */
#define GPIO_BASE_PTRS                       { PTC, PTD, PTE, PTF, PTG, PTH, PTI, PIJ, \
                                               PTK, PTL, PTM, PTN, PTO, PTP }

