newaetech/chipwhisperer/hardware/victims/firmware/hal/mpc5676r/nxp/device/MPC5676R_features.h
/** PORT - Register Layout Typedef */
typedef struct {
  __IO  uint16_t PCR[32];
} PORT_Type;
/** Peripheral PORT base pointer */
#define SIU_PCR_BASE                         (SIU->PCR)
#define SIU_IMUX_BASE                        (0xC3F91200u)
/* PORT - Peripheral instance base addresses */
#define PORTC                                ((PORT_Type *)(SIU_PCR_BASE + 0x0040))
#define PORTD                                ((PORT_Type *)(SIU_PCR_BASE + 0x0060))
#define PORTE                                ((PORT_Type *)(SIU_PCR_BASE + 0x0080))
#define PORTF                                ((PORT_Type *)(SIU_PCR_BASE + 0x00A0))
#define PORTG                                ((PORT_Type *)(SIU_PCR_BASE + 0x00C0))
#define PORTH                                ((PORT_Type *)(SIU_PCR_BASE + 0x00E0))
#define PORTI                                ((PORT_Type *)(SIU_PCR_BASE + 0x0100))
#define PORTJ                                ((PORT_Type *)(SIU_PCR_BASE + 0x0120))
#define PORTK                                ((PORT_Type *)(SIU_PCR_BASE + 0x0140))
#define PORTL                                ((PORT_Type *)(SIU_PCR_BASE + 0x0160))
#define PORTM                                ((PORT_Type *)(SIU_PCR_BASE + 0x0180))
#define PORTN                                ((PORT_Type *)(SIU_PCR_BASE + 0x01A0))
#define PORTO                                ((PORT_Type *)(SIU_PCR_BASE + 0x01C0))
#define PORTP                                ((PORT_Type *)(SIU_PCR_BASE + 0x01E0))
/** Array initializer of PORT peripheral base pointers */
#define PORT_BASE_PTRS                       { PORTC, PORTD, PORTE, PORTF, PORTG, PORTH, \
                                               PORTI, PORTJ, PORTK, PORTL, PORTM, PORTN, \
                                               PORTO, PORTP }

/* MCAN module features */

/* @brief MCAN Ram Start Address */
#define FEATURE_MCAN_MESSAGE_RAM_START_ADR  0xFFE34000U
/* @brief MCAN Max Number of supported Message Buffers as Rx */
#define FEATURE_MCAN_RX_MB_NUM              (64U)
/* @brief MCAN Max Number of supported Message Buffers as Tx */
#define FEATURE_MCAN_TX_MB_NUM              (32U)
/* @brief MCAN Max Number of standard ID elements used as FiltersID */
#define FEATURE_MCAN_STD_ID_NUM             (128U)
/* @brief MCAN Max Number of extended ID elements used as FiltersID */
#define FEATURE_MCAN_EXT_ID_NUM             (64U)
/* @brief MCAN Max Number of supported WORDS accessed by one interface */
#define FEATURE_MCAN_RAM_MESSAGES_WRD       (1216UL)
/* @brief MCAN Number of RxFIFOs */
#define FEATURE_MCAN_NO_RXFIFO				(2U)

/* TIMING_PAL module features */
/* @brief The issue: PIT and STM modules can not run if the stop in debug mode is enabled */
#define TIMING_PAL_HAS_PIT_STM_NOT_WORK_IN_DEBUG_MODE (1U)
/* @brief PIT default interrupt handler */
#define PIT_Ch0_IRQHandler   PIT_RTI0_IRQHandler

#define PIT_Ch1_IRQHandler   PIT_RTI1_IRQHandler

#define PIT_Ch2_IRQHandler   PIT_RTI2_IRQHandler

#define PIT_Ch3_IRQHandler   PIT_RTI3_IRQHandler
/* @brief STM default interrupt handler */
#define STM0_Ch0_IRQHandler   STM_CIR0_IRQHandler

#define STM0_Ch123_IRQHandler STM_CIR123_IRQHandler

/* TDM module features */

/*! @brief TDR count */
#define TDR_COUNT 6U

/* PASS module features */

/* @brief Has Region 0 */
#define FEATURE_PASS_HAS_RL0                  (0U)
/* @brief Has Region 1 */
#define FEATURE_PASS_HAS_RL1                  (1U)
/* @brief Has Region 2 */
#define FEATURE_PASS_HAS_RL2                  (2U)
/* @brief Has Region 3 */
#define FEATURE_PASS_HAS_RL3                  (3U)

/* PASS module features */

/* @brief Has Region 0 */
#define FEATURE_PASS_HAS_RL0                  (0U)
/* @brief Has Region 1 */
#define FEATURE_PASS_HAS_RL1                  (1U)
/* @brief Has Region 2 */
#define FEATURE_PASS_HAS_RL2                  (2U)
/* @brief Has Region 3 */
#define FEATURE_PASS_HAS_RL3                  (3U)

/* IGF module features */

/* @brief The Cluster channel for group 0 from channel 0 to 31 */
#define FEATURE_IGF_CLUSTER_CHANNEL_GROUP_0                  (0U)
/* @brief The Cluster channel for group 1 from channel 32 to 45 */
#define FEATURE_IGF_CLUSTER_CHANNEL_GROUP_1                  (32U)
/* @brief The max channel id of instance 0 */
#define FEATURE_IGF_MAX_CHANNEL_INSTANCE_0                  (29U)
/* @brief The max channel id of instance 1 */
#define FEATURE_IGF_MAX_CHANNEL_INSTANCE_1                  (45U)

#define FEATURE_IGF_MAX_CHANNEL_INSTANCE_ARRAY_DEFINE \
{                                        \
    FEATURE_IGF_MAX_CHANNEL_INSTANCE_0,              \
    FEATURE_IGF_MAX_CHANNEL_INSTANCE_1               \
}

/* ZIPWIRE module features */

/* @brief LFAST data rate change delay */
#define LFAST_DATA_RATE_CHANGE_DELAY 0xFU
/* @brief LFAST wakeup delay control register */
#define LFAST_WAKEUP_DELAY_CONTROL 0x12015402UL
/* @brief LFAST enable slave tx command */
#define LFAST_ENABLE_SLAVE_TX_CMD 0x31U
/* @brief LFAST check slave status command */
#define LFAST_CHECK_SLAVE_STATUS_CMD 0x0U
/* @brief LFAST enable slave pll command */
#define LFAST_ENABLE_SLAVE_PLL_CMD 0x02U
/* @brief LFAST change slave tx speed mode command */
#define LFAST_CHANGE_SLAVE_TX_SPEED_MODE_CMD 0x80U
/* @brief LFAST change slave rx speed mode command */
#define LFAST_CHANGE_SLAVE_RX_SPEED_MODE_CMD 0x10U
/* @brief Clock names for LFAST */
#define LFAST_CLOCK_NAMES {LFAST0_CLK}
/* @brief SIPI channel error flags masks */
#define SIPI_CH0_ERR_MASK 0xFFUL
#define SIPI_CH1_ERR_MASK 0xFF00UL
#define SIPI_CH2_ERR_MASK 0xFF0000UL
#define SIPI_CH3_ERR_MASK 0xFF000000UL
/* @brief SIPI channel count */
#define SIPI_CHANNEL_COUNT 4U
/* @brief SIPI streaming channel number */
#define SIPI_STREAMING_CH 2U
/* @brief SIPI reset timeout */
#define SIPI_RESET_TIMEOUT 10000U
/* @brief SIPI stream channel data register access */
#define SIPI_STREAM_DATA(x) (SIPI->CDR2[(x)])
/* @brief SIPI stream transfer length in bytes */
#define SIPI_STREAM_TRANSFER_LEN 8U
/* @brief SIPI data access macros */
#define SIPI_DATA_SHIFT(x) ((uint32_t)(0x18U & (0x18U << ((uint8_t)(x)))))
#define SIPI_DATA(x,y)     ((x) >> SIPI_DATA_SHIFT(y))
/* @brief SIPI interrupt lines count */
#define SIPI_IRQ_COUNT 1U
/* @brief SIPI ored interrupt lines */
#define SIPI_ORED_INT_LINES
/* @brief Clock names for SIPI */
#define SIPI_CLOCK_NAMES {SIPI0_CLK}

/* DECFILTER module features */
#define FEATURE_DECFILTER_HAS_PSI   (1U)
#define FEATURE_DECFILTER_ENHANCED_DEBUG (1U)

#endif /* MPC5777C_FEATURES_H */

/*******************************************************************************
 * EOF
 ******************************************************************************/
